Repository: furkanuysal/linguess
Catalog: lib/l10n/app_*.arb
Languages: de, es, tr

source: Select Category
de: Kategorie auswählen
es: Seleccionar categoría
tr: Kategori Seçin

source: Select Level
de: Stufe auswählen
es: Seleccionar nivel
tr: Seviye Seçin

source: Daily Word
de: Tägliches Wort
es: Palabra diaria
tr: Günlük Kelime

source: Settings
de: Einstellungen
es: Configuración
tr: Ayarlar

source: Category
de: Kategorie
es: Categoría
tr: Kategori

source: Next Word
de: Nächstes Wort
es: Siguiente palabra
tr: Sonraki Kelime

source: Check Answer
de: Antwort überprüfen
es: Comprobar respuesta
tr: Cevabı Kontrol Et

# letterHint
source: Hint
de: Hinweis
es: Pista
tr: İpucu

source: Your Word
de: Dein Wort
es: Tu palabra
tr: Kelimeniz

source: Level
de: Stufe
es: Nivel
tr: Seviye

source: Translation
de: Übersetzung
es: Traducción
tr: Çeviri

source: Close
de: Schließen
es: Cerrar
tr: Kapat

source: Sign In
de: Anmelden
es: Iniciar sesión
tr: Giriş Yap

source: Sign Out
de: Abmelden
es: Cerrar sesión
tr: Çıkış Yap

source: Signed Out
de: Abgemeldet
es: Cierre de sesión
tr: Oturum kapatıldı

# signInSubtitle
source: Enter your email and password to sign in
de: Geben Sie Ihre E-Mail und Ihr Passwort ein, um sich anzumelden
es: Introduce tu correo electrónico y contraseña para iniciar sesión
tr: E-posta ve şifrenizle hesabınıza giriş yapın

# signUpSubtitle
source: Create an account by entering your email and password
de: Erstellen Sie ein Konto, indem Sie Ihre E-Mail und Ihr Passwort eingeben
es: Crea una cuenta introduciendo tu correo electrónico y contraseña
tr: E-posta ve şifrenizle yeni bir hesap oluşturun

source: Profile
de: Profil
es: Perfil
tr: Profil

source: Correct Answer
de: Richtige Antwort
es: Respuesta correcta
tr: Doğru Cevap

# correctText
source: Correct
de: Richtig
es: Correcto
tr: Doğru

# signUpButtonText
source: Don't have an account? Sign up
de: Kein Konto? Registrieren
es: ¿No tienes cuenta? Regístrate
tr: Hesabın yok mu? Kayıt ol

source: Email
es: Correo electrónico
tr: E-posta

source: Password
de: Passwort
es: Contraseña
tr: Şifre

source: Sign Up
de: Registrieren
es: Registrarse
tr: Kayıt Ol

# signUpSuccess
source: Registration successful! You can sign in now.
de: Registrierung erfolgreich! Sie können sich jetzt anmelden.
es: ¡Registro exitoso! Ya puedes iniciar sesión.
tr: Kayıt başarılı! Giriş yapabilirsiniz.

# invalidEmail
source: Invalid email address
de: Ungültige E-Mail-Adresse
es: Correo electrónico no válido
tr: Geçersiz e-posta adresi

# passwordTooShort
source: Password must be at least 6 characters long
de: Das Passwort muss mindestens 6 Zeichen lang sein
es: La contraseña debe tener al menos 6 caracteres
tr: Şifre en az 6 karakter olmalıdır

source: Gold
es: Oro
tr: Altın

# learnedWordsText
source: Learned Words
de: Gelernte Wörter
es: Palabras aprendidas
tr: Öğrenilen Kelimeler

# learnedWordsEmpty
source: No words learned yet
de: Noch keine gelernten Wörter
es: No hay palabras aprendidas aún
tr: Henüz öğrenilen kelime yok

# errorOccurred
source: An error occurred
de: Ein Fehler ist aufgetreten
es: Ocurrió un error
tr: Bir hata oluştu

source: No data to show
de: Keine Daten zum Anzeigen
es: No hay datos para mostrar
tr: Gösterilecek veri yok

# errorSignInFailed
source: Sign-in failed
de: Anmeldung fehlgeschlagen
es: Error al iniciar sesión
tr: Giriş başarısız

source: Word Count
de: Wortanzahl
es: Número de palabras
tr: Kelime Sayısı

# settingsLearnedWords
source: Show learned words again
de: Gelernte Wörter wiederholen
es: Repetir palabras aprendidas
tr: Öğrenilen kelimeleri tekrar göster

# settingsSoundEffects
source: Sound Effects
de: Soundeffekte
es: Efectos de sonido
tr: Ses efektleri

# learnedCountText
source: Words Learned
de: Wort gelernt
es: Palabra aprendida
tr: Kelime Öğrenildi

# settingsDarkMode
source: Dark Mode
de: Dunkelmodus
es: Modo oscuro
tr: Karanlık mod

# mainMenuPlayModeSelection
source: Select a game mode
de: Wählen Sie einen Spielmodus
es: Selecciona un modo de juego
tr: Bir oyun türü seçin

source: Insufficient Gold
de: Nicht genügend Gold
es: Oro insuficiente
tr: Yetersiz Altın

# dailyWordCompletedTitleAlert
source: Daily Word Completed
de: Tägliches Wort abgeschlossen
es: Palabra diaria completada
tr: Günlük Kelime Tamamlandı

# dailyWordCompletedBodyAlert
source: You solved today's word. A new word will be available tomorrow!
de: Sie haben das Wort des Tages entschlüsselt. Morgen gibt es ein neues Wort!
es: Has descifrado la palabra de hoy. ¡Mañana habrá una nueva palabra!
tr: Bugünün kelimesini çözdünüz. Yeni kelime yarın!

source: Okay
de: OK
es: Aceptar
tr: Tamam

# emailRequired
source: Email field cannot be empty!
de: E-Mail-Adresse ist erforderlich!
es: ¡El campo de correo electrónico no puede estar vacío!
tr: E-posta alanı boş bırakılamaz!

# passwordRequired
source: Password field cannot be empty!
de: Passwort ist erforderlich!
es: ¡El campo de contraseña no puede estar vacío!
tr: Şifre alanı boş bırakılamaz!

# errorSignUpFailed
source: Sign-up failed
de: Fehler bei der Registrierung
es: Error al registrarse
tr: Kayıt başarısız

# errorWeakPassword
source: Password is too weak
de: Passwort zu schwach
es: Contraseña muy débil
tr: Şifre çok zayıf

# errorEmailAlreadyInUse
source: This email is already in use!
de: Diese E-Mail-Adresse ist bereits vergeben!
es: ¡Este correo electrónico ya está en uso!
tr: Bu e-posta zaten kullanılıyor!

# errorUserNotFound
source: User not found.
de: Benutzer nicht gefunden.
es: Usuario no encontrado.
tr: Kullanıcı bulunamadı.

# errorTooManyRequests
source: Too many attempts have been made. Please try again later.
de: Zu viele Versuche. Bitte versuchen Sie es später erneut.
es: Se han realizado demasiados intentos. Por favor, inténtelo de nuevo más tarde.
tr: Çok fazla deneme yapıldı. Lütfen daha sonra tekrar deneyin.

# errorWrongPassword
source: Wrong password!
de: Falsches Passwort!
es: Contraseña incorrecta
tr: Yanlış şifre!

# errorInvalidEmail
source: Invalid email address!
de: Ungültige E-Mail-Adresse!
es: ¡Correo electrónico inválido!
tr: Geçersiz e-posta adresi!

# errorNetwork
source: Network error. Please check your internet connection.
de: Netzwerkfehler. Bitte überprüfen Sie Ihre Internetverbindung.
es: Error de red. Por favor, verifique su conexión a Internet.
tr: Ağ hatası. Lütfen internet bağlantınızı kontrol edin.

# successSignIn
source: Sign-in successful!
de: Anmeldung erfolgreich!
es: ¡Inicio de sesión exitoso!
tr: Giriş başarılı!

# successSignUp
source: Registration successful!
de: Registrierung erfolgreich!
es: ¡Registro exitoso!
tr: Kayıt başarılı!

# errorInvalidCredential
source: Email or password is incorrect!
de: Ungültige E-Mail-Adresse oder Passwort.
es: ¡Correo electrónico o contraseña no válidos!
tr: E-posta veya parola hatalı!

# successResetPasswordEmailSent
source: Password reset email sent!
de: E-Mail zum Zurücksetzen des Passworts erfolgreich gesendet!
es: ¡Correo electrónico de restablecimiento de contraseña enviado!
tr: Şifre sıfırlama e-postası gönderildi!

# sendResetLink
source: Send Password Reset Link
de: Link zum Zurücksetzen senden
es: Enviar enlace de restablecimiento
tr: Şifre sıfırlama bağlantısı gönder

# forgotPassword
source: Forgot your password?
de: Haben Sie Ihr Passwort vergessen?
es: ¿Olvidaste tu contraseña?
tr: Şifrenizi mi unuttunuz?

source: Reset Password
de: Passwort zurücksetzen
es: Restablecer la contraseña
tr: Şifreyi Sıfırla

# totalWordText
source: Total Words
de: Gesamtanzahl der Wörter
es: Total de palabras
tr: Toplam Kelime

# loadingText
source: Loading...
de: Wird geladen...
es: Cargando...
tr: Yükleniyor...

# totalLearnedWordsText
source: Total Learned Words
de: Gesamtanzahl der gelernten Wörter
es: Total de palabras aprendidas
tr: Toplam Öğrenilen Kelime

source: Achievements
de: Erfolge
es: Logros
tr: Başarımlar

source: View All
de: Alle anzeigen
es: Ver todo
tr: Tümünü Gör

source: Coming Soon
de: Demnächst
es: Próximamente
tr: Yakında

# dailyWordSignInRequired
source: You must be signed in to solve the daily word.
de: Für die Lösung des täglichen Wortes ist eine Anmeldung erforderlich.
es: Se requiere iniciar sesión para resolver la palabra diaria.
tr: Günlük kelimeyi çözmek için giriş yapmalısınız.

# achievement_solve_firstword_title
source: First of many!
de: Erstes Wort lösen
es: ¡Primera de muchas!
tr: Her şey bir kelimeyle başlar

# achievement_solve_firstword_description
source: You solved a word for the first time.
de: Du hast zum ersten Mal ein Wort gelöst.
es: Has resuelto una palabra por primera vez.
tr: İlk kez bir kelimeyi çözdün.

# achievement_learn_firstword_title
source: First Word!
de: Erste Wörter lernen
es: ¡Primera palabra!
tr: İlk Kelime!

# achievement_learn_ten_words_title
source: 10/10 Perfect!
de: Zehn Wörter!
es: ¡Diez en total!
tr: Onda On!

# achievement_learn_ten_words_description
source: You learned 10 words.
de: Du hast 10 Wörter gelernt.
es: Has aprendido diez palabras.
tr: 10 kelimeyi öğrendin.

# achievement_learn_twenty_words_title
source: Twenty Words!
de: Zwanzig Wörter!
es: ¡Veinte en total!
tr: Kelime Yolcusu

# achievement_learn_twenty_words_description
source: You learned 20 words.
de: Du hast 20 Wörter gelernt.
es: Has aprendido veinte palabras.
tr: 20 kelimeyi öğrendin.

# achievement_learn_firstword_description
source: You learned a word for the first time.
de: Du hast zum ersten Mal ein Wort gelernt.
es: Has aprendido una palabra por primera vez.
tr: İlk kez bir kelimeyi öğrendin.

# achievement_solve_dailyword_first_time_title
source: Daily Start
de: Tägliches Wort lösen
es: Inicio diario
tr: Günlük Başlangıç

# achievement_solve_dailyword_first_time_description
source: You solved the daily word for the first time.
de: Du hast das tägliche Wort zum ersten Mal gelöst.
es: Has resuelto la palabra diaria por primera vez.
tr: İlk kez günlük kelimeyi çözdün.

# achievement_solve_dailyword_ten_times_title
source: Ten days!
de: Zehn Tage!
es: ¡Diez resueltas!

# achievement_solve_dailyword_ten_times_description
source: You solved the daily word 10 times.
de: Du hast 10 Mal das tägliche Wort gelöst.
es: Has resuelto la palabra diaria diez veces.

# achievement_solve_dailyword_thirty_times_title
source: A month!
de: Ein Monat!
es: ¡Treinta resueltas!
tr: Aylık Usta!

# achievement_solve_dailyword_thirty_times_description
source: You solved the daily word 30 times.
de: Du hast 30 Mal das tägliche Wort gelöst.
es: Has resuelto la palabra diaria treinta veces.
tr: 30 kez günlük kelimeyi çözdün.

# achievement_solve_firstword_nohint_title
source: No hint!
de: Ohne Hilfe gelöst!
es: ¡Sin pistas!
tr: Kopya çekmeden!

# achievement_solve_firstword_nohint_description
source: You solved a word without using any hints.
de: Du hast die erste Wort ohne Hilfe gelöst.
es: Has resuelto la primera palabra sin ninguna pista.
tr: Bir kelimeyi hiç ipucu kullanmadan çözdün.

# achievementUnlockedText
source: Achievement Unlocked!
de: Erfolg freigeschaltet!
es: ¡Logro desbloqueado!
tr: Başarım kazanıldı!

# unknownAchievementTitleText
source: Unknown Achievement
de: Unbekannter Erfolg
es: Logro desconocido
tr: Bilinmeyen Başarım

# unknownAchievementDescriptionText
source: No information available about this achievement.
de: Keine Informationen zu diesem Erfolg verfügbar.
es: Descripción desconocida
tr: Bu başarı hakkında bilgi yok.

# achievement_solve_ten_words_title
source: Tenten!
de: Zehn Wörter lösen
es: ¡Diez resueltas!
tr: Onun gücü, senin gücün!

# achievement_solve_ten_words_description
source: You solved 10 words successfully!
de: Du hast zehn Wörter gelöst.
es: ¡Has resuelto diez palabras!
tr: Başarıyla 10 kelime çözdün!

# achievement_solve_fifty_words_title
source: Half hundred!
de: Wortmeister 50
es: Medio Centenar
tr: 50'lik zafer!

# achievement_solve_fifty_words_description
source: You solved 50 words successfully!
de: Du hast fünfzig Wörter gelöst.
es: ¡Has resuelto cincuenta palabras!
tr: Başarıyla 50 kelime çözdün!

# achievement_solve_hundred_words_description
source: You solved 100 words successfully!
de: Du hast hundert Wörter gelöst.
es: Has resuelto cien palabras.
tr: Başarıyla 100 kelime çözdün!

# achievement_solve_fivehundred_words_title
source: Half thousand!
de: Fünf Hundert Worte, ein Weiser!
es: Medio Milenio
tr: Beş Yüzlü Bilge

# achievement_solve_fivehundred_words_description
source: You solved 500 words successfully!
de: Du hast fünfhundert Wörter gelöst.
es: ¡Has resuelto quinientas palabras!
tr: Başarıyla 500 kelime çözdün!

# achievement_solve_thousand_words_title
source: Thousand!
de: Tausend-sassa
es: Señor de los Mil
tr: Binbaşı Kelime Uzmanı

# achievement_solve_thousand_words_description
source: You solved 1000 words successfully!
de: Du hast tausend Wörter gelöst.
es: Has resuelto mil palabras.
tr: Başarıyla 1000 kelime çözdün!

# achievement_used_definition_powerup_first_time_title
source: Show me the encyclopedia
de: Zeig mir die Enzyklopädie
es: Abrir la Enciclopedia
tr: Ansiklopediyi aç

# achievement_used_definition_powerup_first_time_description
source: You used the definition power-up for the first time.
de: Du hast den Definition-Power-Up zum ersten Mal verwendet.
es: Has utilizado el potenciador de definición por primera vez.
tr: İlk kez tanım güçlendiricisini kullandın.

# achievement_used_hint_powerup_first_time_title
source: Let's get a hint
de: Schlauer Tipp
es: Pista inicial
tr: Ufak kopya

# achievement_used_hint_powerup_first_time_description
source: You used the hint power-up for the first time.
de: Du hast den Hinweis-Power-Up zum ersten Mal verwendet.
es: Has utilizado el potenciador de pista por primera vez.
tr: İlk kez ipucu güçlendiricisini kullandın.

# achievement_used_skip_powerup_first_time_title
source: Fast Forward
de: Schnellvorlauf
es: Saltar inicial
tr: Hızlı atla

# achievement_used_skip_powerup_first_time_description
source: You used the skip power-up for the first time.
de: Du hast den Schnellvorlauf-Power-Up zum ersten Mal verwendet.
es: Has utilizado el potenciador de salto por primera vez.
tr: İlk kez atlama güçlendiricisini kullandın.

# achievement_used_example_sentence_powerup_first_time_title
source: Example Explorer
de: Satzforscher
es: Explorador de frases
tr: Cümlelerle güçlen

# achievement_used_example_sentence_powerup_first_time_description
source: You used the example sentence power-up for the first time.
de: Du hast zum ersten Mal den Beispielsatz-Power-Up benutzt.
es: Has usado el potenciador de frases de ejemplo por primera vez.
tr: İlk kez örnek cümle güçlendiricisini kullandın.

# achievement_used_example_sentence_target_powerup_first_time_title
source: Examples from other dimension
de: Beispiele aus einer anderen Dimension
es: Ejemplos de otra dimensión
tr: Hedef dilde örnekler

# achievement_used_example_sentence_target_powerup_first_time_description
source: You used the target language example sentence power-up for the first time.
de: Du hast zum ersten Mal den Zielsprachen-Beispielsatz-Power-Up benutzt.
es: Has usado por primera vez el potenciador de frases de ejemplo en el idioma objetivo.
tr: İlk kez hedef dilde örnek cümle güçlendiricisini kullandın.

# adNotReady
source: Ad not ready. Please try again later.
de: Anzeige nicht verfügbar. Bitte später erneut versuchen.
es: Anuncio no disponible. Inténtalo de nuevo más tarde.
tr: Reklam hazır değil. Biraz sonra tekrar deneyin.

# adNotLoaded
source: Ad could not be loaded.
de: Anzeige nicht geladen.
es: Anuncio no cargado.
tr: Reklam gösterilemiyor.

# adRewardGoldEarned
source: You earned {gold} gold as an ad reward!
de: Als Werbebelohnung hast du {gold} Gold erhalten!
es: ¡Has ganado {gold} de oro como recompensa por el anuncio!
tr: Reklam ödülü olarak {gold} altın kazandınız!

# adRewardTooltip
source: Ad reward
de: Verdiene Gold, indem du Werbung ansiehst.
es: Gana oro viendo anuncios.
tr: Reklam ödülü

source: App Language
de: App-Sprache
es: Idioma de la aplicación
tr: Uygulama Dili

source: Target Language
de: Zielsprache
es: Idioma de destino
tr: Hedef Dil

# selectCategoryDescription
source: Choose from different word categories
de: Wählen Sie eine der verschiedenen Wortkategorien
es: Selecciona una de las diferentes categorías de palabras
tr: Farklı kelime kategorilerinden birini seçin

# selectLevelDescription
source: Choose your difficulty level
de: Wählen Sie Ihr Schwierigkeitsniveau
es: Elige tu nivel de dificultad
tr: Zorluk seviyenizi seçin

# dailyWordDescription
source: Today's special challenge
de: Die besondere Herausforderung von heute
es: El desafío especial de hoy
tr: Bugünün özel meydan okuması

# adRewardConfirmTitle
source: Watch Ad for Gold
de: Werbung ansehen?
es: ¿Ver anuncio?
tr: Reklam ödülü!

# adRewardConfirmBody
source: Do you want to watch an ad to earn {gold} gold?
de: Möchten Sie eine Werbung ansehen, um {gold} Gold zu verdienen?
es: ¿Quieres ver un anuncio para ganar {gold} de oro?
tr: Reklamı izleyerek {gold} altın kazanabilirsiniz.

# cancelText
source: Cancel
de: Abbrechen
es: Cancelar
tr: Vazgeç

# watchAdText
source: Watch Ad
de: Werbung ansehen
es: Ver anuncio
tr: Reklamı İzle

source: Overwrite if exists
de: Vorhandene Einträge überschreiben
es: Sobrescribir si existe
tr: Mevcutsa Üzerine Yaz

# saveText
source: Save
de: Speichern
es: Guardar
tr: Kaydet

# addUpdateWordTitle
source: Add / Update Word
de: Wort Hinzufügen / Aktualisieren
es: Agregar / Actualizar Palabra
tr: Kelime Ekle / Güncelle

# errorOnlyAdminsCanAccess
source: Only admins can access this page.
de: Nur Administratoren können auf diese Seite zugreifen.
es: Solo los administradores pueden acceder a esta página.
tr: Yalnızca yöneticiler erişebilir.

# requiredText
source: Required
de: Erforderlich
es: Requerido
tr: Gerekli

# chooseCategoryAndLevel
source: Please choose a category and level.
de: Bitte wählen Sie eine Kategorie und ein Niveau aus.
es: ¡Elige una categoría y un nivel!
tr: Lütfen bir kategori ve seviye seçin.

source: No daily entries
de: Keine täglichen Einträge
es: No hay entradas diarias.
tr: Günlük kelimelere ait giriş yok

# dailyListText
source: Daily List
de: Tägliche Liste
es: Lista diaria
tr: Günlük Kelime Listesi

# deleteWordText
source: Delete Word
de: Wort löschen
es: Eliminar palabra
tr: Kelime Sil

# deleteWordBody
source: Are you sure you want to delete the word '{word}'?
de: Sind Sie sicher, dass Sie das Wort '{word}' löschen möchten?
es: ¿Estás seguro de que deseas eliminar la palabra '{word}'?
tr: Kelime '{word}' silinsin mi?

# wordSuccessfullyDeleted
source: Word deleted successfully.
de: Wort erfolgreich gelöscht.
es: Palabra eliminada con éxito.
tr: Kelime başarıyla silindi.

# addWordTitle
source: Add New Word
de: Neues Wort hinzufügen
es: Agregar nueva palabra
tr: Yeni Kelime Ekle

# updateWordText
source: Update Word
de: Wort aktualisieren
es: Actualizar palabra
tr: Kelime Güncelle

# allText
source: All
de: Alle
es: Todo
tr: Tümü

source: Search the word (English)
es: Buscar la palabra (inglés)
tr: Kelimeyi Ara (İngilizce)

# clearText
source: Clear
de: Löschen
es: Limpiar
tr: Temizle

source: No words found
de: Keine Wörter gefunden
es: No se encontraron palabras.
tr: Hiç kelime bulunamadı

# wordsListText
source: Words List
de: Wörterliste
es: Lista de palabras
tr: Kelime Listesi

# addWordDesc
source: Create a new word entry
de: Fügen Sie ein neues Wort zur Datenbank hinzu
es: Crear una nueva entrada de palabra
tr: Yeni bir kelime girişi oluştur

# wordsListDesc
source: View and manage existing words
de: Bestehende Wörter anzeigen und verwalten
es: Ver y gestionar palabras existentes
tr: Mevcut kelimeleri görüntüle ve yönet

# dailyListDesc
source: View recent daily picks
de: Anzeigen der aktuellen täglichen Auswahlen
es: Ver selecciones diarias recientes
tr: Günlük kelime seçimlerini görüntüle

# adminPanelTitle
source: Admin Panel
es: Panel de administración

source: Saved successfully
de: Erfolgreich gespeichert
es: Guardado con éxito
tr: Başarıyla kaydedildi

# categoriesText
source: Categories
de: Kategorien
es: Categorías
tr: Kategoriler

# categoryListDesc
source: View and manage existing categories
de: Bestehende Kategorien anzeigen und verwalten
es: Ver y gestionar categorías existentes
tr: Mevcut kategorileri görüntüle ve yönet

source: Manage Categories
de: Kategorien verwalten
es: Gestionar categorías
tr: Kategorileri Yönet

# addCategory
source: Add New Category
de: Neue Kategorie hinzufügen
es: Agregar nueva categoría
tr: Yeni Kategori Ekle

# moveUpText
source: Move Up
de: Nach oben verschieben
es: Mover hacia arriba
tr: Yukarı Taşı

# moveDownText
source: Move Down
de: Nach unten verschieben
es: Mover hacia abajo
tr: Aşağı Taşı

# updateCategoryText
source: Update Category
de: Kategorie aktualisieren
es: Actualizar categoría
tr: Kategori Güncelle

# deleteCategoryText
source: Delete Category
de: Kategorie löschen
es: Eliminar categoría
tr: Kategori Sil

# categoryIdFormLabel
source: Category ID (slug, immutable)
de: Kategorie-ID (Slug, unveränderlich)
es: ID de categoría (slug, inmutable)
tr: Kategori ID'si (kısa ad, değiştirilemez)

# categoryIconFormLabel
source: Category Icon (Material icon codePoint, optional)
de: Kategorie-Icon (Material-Icon-CodePoint, optional)
es: Icono de categoría (código de punto de icono de Material, opcional)
tr: Kategori Simgesi (Material icon codePoint, opsiyonel)

# deleteCategoryConfirmation
source: Delete category '{id}'?
de: Kategorie '{id}' löschen?
es: ¿Eliminar categoría '{id}'?
tr: Kategori '{id}' silinsin mi?

# categorySuccessfullyDeleted
source: Category deleted successfully.
de: Kategorie erfolgreich gelöscht.
es: Categoría eliminada con éxito.
tr: Kategori başarıyla silindi.

# thisPowerUpNotAllowedInDaily
source: This power-up is not allowed in daily mode
de: Dieser Power-Up ist im täglichen Modus nicht erlaubt
es: Este potenciador no está permitido en el modo diario.
tr: Günlük modda bu güçlendirici kullanılamaz.

# allLettersRevealed
source: All letters have already been revealed
de: Alle Buchstaben aufgedeckt
es: Todas las letras reveladas
tr: Tüm harfler zaten açıldı

# skipToNext
source: Skip to Next Word
de: Zum nächsten Wort überspringen
es: Saltar a la siguiente palabra
tr: Sonraki kelimeye atla

source: Nothing to Skip
de: Nichts zum Überspringen
es: Nada que saltar
tr: Atlanacak kelime yok

# wordMeaningText
source: Word Meaning
de: Wortbedeutung
es: Significado de la palabra
tr: Kelime Anlamı

source: Sign in with Google
de: Mit Google anmelden
es: Iniciar sesión con Google
tr: Google ile Giriş Yap

source: Sign up with Google
de: Mit Google registrieren
es: Registrarse con Google
tr: Google ile Kayıt Ol

source: Sign in with GitHub
de: Mit GitHub anmelden
es: Iniciar sesión con GitHub
tr: GitHub ile Giriş Yap

source: Sign up with GitHub
de: Mit GitHub registrieren
es: Registrarse con GitHub
tr: GitHub ile Kayıt Ol

# orText
source: or
de: oder
es: o
tr: veya

# showText
source: Show
de: Anzeigen
es: Mostrar
tr: Göster

# hideText
source: Hide
de: Verbergen
es: Ocultar
tr: Gizle

source: Sign-in canceled
de: Anmeldung abgebrochen
es: Inicio de sesión cancelado
tr: Giriş iptal edildi

source: Sign-up canceled
de: Anmeldung abgebrochen
es: Registro cancelado
tr: Kayıt iptal edildi

# signedInAs
source: Signed in as {email}
de: Angemeldet als {email}
es: Conectado como {email}
tr: {email} olarak giriş yapıldı

# signedUpAs
source: Signed up as {email}
de: Registriert als {email}
es: Registrado como {email}
tr: {email} olarak kayıt olundu

# errorResetPasswordFailed
source: Password reset failed
de: Fehler beim Zurücksetzen des Passworts
es: Error al restablecer la contraseña
tr: Şifre sıfırlama başarısız

source: Show Definition
de: Definition Anzeigen
es: Mostrar definición
tr: Tanımı Göster

source: No Definition to Show
de: Keine Definition zum Anzeigen
es: No hay definición para mostrar
tr: Gösterilecek bir tanım yok

# definitionHintTitle
source: Definition Hint
de: Definition Hinweis
es: Título de la definición
tr: Kelime Tanımı
