Repository: furkanuysal/linguess
Catalog: lib/l10n/app_*.arb
Languages: de, es, tr

# exampleSentenceText
source: Example Sentence
de: Beispielsatz
es: Ejemplo de oración
tr: Örnek Cümle

# exampleSentenceHint
source: Show Example Sentence
de: Beispielsatz anzeigen
es: Mostrar ejemplo de oración
tr: Örnek cümleyi göster

source: No Example Sentence to Show
de: Keine Beispielsätze zum Anzeigen
es: No hay ejemplo de oración para mostrar
tr: Gösterilecek bir örnek cümle yok

# exampleSentenceTargetHint
source: Show Example Sentence in Target Language
de: Beispielsatz in Zielsprache anzeigen
es: Mostrar ejemplo de oración en el idioma de destino
tr: Hedef dilde örnek cümleyi göster

# noExampleSentenceTargetToShow
source: No Example Sentence in Target Language to Show
de: Keine Beispielsätze in Zielsprache zum Anzeigen
es: No hay ejemplo de oración en el idioma de destino para mostrar
tr: Hedef dilde gösterilecek bir örnek cümle yok

# exampleSentenceTargetTitle
source: Example Sentence in Target Language
de: Beispielsatz in Zielsprache
es: Ejemplo de oración en el idioma de destino
tr: Hedef Dilde Örnek Cümle

source: Error loading progress
de: Fehler beim Laden des Fortschritts
es: Error al cargar el progreso
tr: İlerleme yüklenirken hata oluştu

# learnedWordText
source: Learned Word
de: Gelerntes Wort
es: Palabra aprendida
tr: Öğrenilmiş Kelime

# theWordIsLearnedText
source: The word is learned!
de: Das Wort ist gelernt!
es: La palabra ha sido aprendida.
tr: Kelime öğrenildi!

# mainMenuLearnNewWordsToday
source: Learn new words today!
de: Lerne heute neue Wörter!
es: ¡Aprende nuevas palabras hoy!
tr: Bugün yeni kelimeler öğren!

# todayText
source: Today
de: Heute
es: Hoy
tr: Bugün

# translationsText
source: Translations
de: Übersetzungen
es: Traducciones
tr: Çeviriler

# categoryEditSubtitle
source: Enter the category name for each language. Empty fields will be preserved.
de: Kategorie Name für jede Sprache eingeben. Leere Felder werden beibehalten.
es: Introduce el nombre de la categoría para cada idioma. Los campos vacíos se conservarán.
tr: Kategori adını her dil için gir. Boş bıraktıkların korunur.

# categoryAddSubtitle
source: Category ID must be unique. *required field
de: Kategorie ID muss einzigartig sein. *Pflichtfeld
es: El ID de la categoría debe ser único. *campo obligatorio
tr: Kategori ID'si benzersiz olmalıdır. *zorunlu alan

# progressNotSaved
source: You are playing as a guest, your progress will not be saved.
de: Du spielst als Gast, dein Fortschritt wird nicht gespeichert.
es: Estás jugando como invitado, tu progreso no se guardará.
tr: Misafir olarak oynuyorsun, ilerlemen kaydedilmeyecek.

# signInUpsellText
source: Sign in to save your gold, progress, and achievements.
de: Melde dich an, um dein Gold, deinen Fortschritt und deine Erfolge zu speichern.
es: Inicia sesión para guardar tu oro, progreso y logros.
tr: Giriş yaparak altınlarını, ilerlemeni ve başarımlarını kaydet.

# continueToPlayAsGuest
source: Continue playing as a guest
de: Als Gast weiterspielen
es: Continuar jugando como invitado
tr: Misafir olarak oynamaya devam et

source: Preparing Ad...
de: Anzeige wird vorbereitet...
es: Preparando anuncio...
tr: Reklam hazırlanıyor...

source: Custom Game
de: Benutzerdefiniertes Spiel
es: Juego Personalizado
tr: Özel Oyun

# customGameDescription
source: Create your own game by your own rules!
de: Erstelle dein eigenes Spiel nach deinen eigenen Regeln!
es: ¡Crea tu propio juego con tus propias reglas!
tr: Kendi seçeneklerinle özel bir oyun oluştur.

source: Start Custom Game
de: Benutzerdefiniertes Spiel starten
es: Iniciar Juego Personalizado
tr: Özel Oyunu Başlat

source: None Selected
de: Keine ausgewählt
es: Ninguno seleccionado
tr: Hiçbiri seçilmedi

source: Clear Selection
de: Auswahl löschen
es: Borrar selección
tr: Seçimi Temizle

# meaningOfYourWord
source: The meaning of your word
de: Die Bedeutung deines Wortes
es: El significado de tu palabra
tr: Kelimenizin Anlamı

source: Meaning Mode
de: Bedeutungsmodus
es: Modo de Significado
tr: Anlam Modu

# meaningModeDescription
source: Guess the word based on its meaning!
de: In diesem Modus musst du das Wort basierend auf seiner Bedeutung erraten.
es: ¡Adivina la palabra según su significado!
tr: Kelimenin anlamınından kelimeyi tahmin edin.

# fallbackInfoTitle
source: Info
es: Información
tr: Bilgi

# fallbackInfoMessage
source: No unlearned words left in this category or level. Continuing with learned words.
de: Keine ungelernten Wörter mehr in dieser Kategorie oder diesem Niveau. Es wird mit gelernten Wörtern fortgefahren.
es: No quedan palabras no aprendidas en esta categoría o nivel. Continuando con palabras aprendidas.
tr: Bu kategoride veya seviyede öğrenilmemiş kelime kalmadı. Öğrenilmiş kelimelerden devam ediliyor.

# noWordsFoundMessage
source: No words found in this category or level.
de: Keine Wörter in dieser Kategorie oder diesem Niveau gefunden.
es: No se encontraron palabras en esta categoría o nivel.
tr: Bu kategoride veya seviyede hiç kelime bulunamadı.

# wordText
source: Word
de: Wort
es: Palabra
tr: Kelime

# meaningText
source: Meaning
de: Bedeutung
es: Significado
tr: Anlam

source: Select Play Mode
de: Spielmodus auswählen
es: Seleccionar Modo de Juego
tr: Oyun Modu Seçin

source: Mode not selected
de: Modus nicht ausgewählt
es: Modo no seleccionado
tr: Oyun modu seçilmedi

source: Category not selected
de: Kategorie nicht ausgewählt
es: Categoría no seleccionada
tr: Kategori seçilmedi

source: Level not selected
de: Level nicht ausgewählt
es: Nivel no seleccionado
tr: Seviye seçilmedi

# listViewTooltip
source: List View
de: Listenansicht
es: Vista de Lista
tr: Liste Görünümü

# gridViewTooltip
source: Grid View
de: Karoansicht
es: Vista de Cuadrícula
tr: Karo Görünümü

source: Category or level not selected
de: Kategorie oder Level nicht ausgewählt
es: Categoría o nivel no seleccionado
tr: Kategori veya seviye seçilmedi

# timeAttackText
source: Time Attack
de: Zeitduell
es: Contra Reloj
tr: Zamana Karşı

# optionalLevelCanBeSelected
source: Optionally, you can select levels that contain a sufficient number of words.
de: Optional kannst du Level auswählen, die genügend Wörter enthalten.
es: Opcionalmente, puedes seleccionar los niveles que contengan suficientes palabras.
tr: İsteğe bağlı, yeterli sayıda kelime bulunan seviyelerden seçim yapılabilir.

# optionalCategoryCanBeSelected
source: Optionally, you can select categories that contain a sufficient number of words.
de: Optional kannst du Kategorien auswählen, die genügend Wörter enthalten.
es: Opcionalmente, puedes seleccionar las categorías que contengan suficientes palabras.
tr: İsteğe bağlı, yeterli sayıda kelime bulunan kategorilerden seçim yapılabilir.

# correctCountText
source: Correct Answers: {correctCount}
de: Korrekte Antworten: {correctCount}
es: Respuestas correctas: {correctCount}
tr: Doğru Sayısı: {correctCount}

# timeAttackEndedTitle
source: Time Attack Ended!
de: Zeitduell Beendet
es: ¡El modo contra reloj ha terminado!
tr: Zamana Karşı Oyun Bitti!

# tryAgainText
source: Try Again
de: Versuche es erneut
es: Inténtalo de nuevo
tr: Tekrar Dene

source: Return to Main Menu
de: Zurück zum Hauptmenü
es: Volver al menú principal
tr: Ana Menüye Dön

# insufficientWordsForTimeAttack
source: Not enough words for time attack mode. Please select a different category or level.
de: Nicht genügend Wörter für den Zeitangriff-Modus. Bitte wähle eine andere Kategorie oder ein anderes Level.
es: No hay suficientes palabras para el modo contra reloj. Por favor, selecciona otra categoría o nivel.
tr: Zamana karşı mod için yeterli kelime yok. Lütfen başka bir kategori veya seviye seçin.

# totalGoldEarned
source: Total Gold Earned: {totalGold}
de: Insgesamt verdientes Gold: {totalGold}
es: Oro total ganado: {totalGold}
tr: Toplam Kazanılan Altın: {totalGold}

# earlyCompletionBonusGold
source: Early Completion Bonus: {bonusGold}
de: Frühzeitiger Abschlussbonus: {bonusGold}
es: Bonificación por finalización anticipada: {bonusGold}
tr: Erken Tamamlama Bonusu: {bonusGold}

# noWordSolvedText
source: Unfortunately, no words were solved.
de: Leider wurden keine Wörter gelöst.
es: Por desgracia, no se resolvió ninguna palabra.
tr: Maalesef hiçbir kelimeyi bilemediniz.

# consolationRewardGold
source: Consolation Reward: {bonusGold}
de: Trostpreis: {bonusGold}
es: Recompensa de Consolación: {bonusGold}
tr: Teselli Ödülü: {bonusGold}

# goldEarnedFromSolvedWords
source: Gold Earned from Words: {solvedWordsGold}
de: Verdientes Gold aus Wörtern: {solvedWordsGold}
es: Oro ganado por palabras: {solvedWordsGold}
tr: Kelimelerden Kazanılan Altın: {solvedWordsGold}

# lastSolvedWord
source: Last Solved Word: {lastSolvedWord}
de: Zuletzt gelöstes Wort: {lastSolvedWord}
es: Última palabra resuelta: {lastSolvedWord}
tr: Son Çözülmüş Kelime: {lastSolvedWord}

# lastSolvedAt
source: Last Solved At: {lastSolvedAt}
de: Zuletzt gelöst am: {lastSolvedAt}
es: Última resolución: {lastSolvedAt}
tr: Son Çözülme Zamanı: {lastSolvedAt}

# dailySolvedCount
source: Daily Words Solved: {dailySolvedCount}
de: Täglich gelöste Wörter: {dailySolvedCount}
es: Palabras diarias resueltas: {dailySolvedCount}
tr: Çözülen Günlük Kelime Sayısı: {dailySolvedCount}

# statistictsTitle
source: Statistics
de: Statistiken
es: Estadísticas
tr: İstatistikler

source: Loading statistics...
de: Statistiken werden geladen...
es: Cargando estadísticas...
tr: İstatistikler yükleniyor...

# noStatsAvailable
source: No statistics available
de: Keine Statistiken verfügbar
es: No hay estadísticas disponibles
tr: Mevcut istatistik yok

# errorLoadingStats
source: Error loading statistics
de: Fehler beim Laden der Statistiken
es: Error al cargar las estadísticas
tr: İstatistikler yüklenirken hata oluştu

# timeAttackHighScore
source: Time Attack High Score: {timeAttackHighScore}
de: Zeitduell Höchstpunktzahl: {timeAttackHighScore}
es: Mejor puntuación en Contra Reloj: {timeAttackHighScore}
tr: Zamana Karşı En Yüksek Skor: {timeAttackHighScore}

# loadingHintStats
source: Loading hint statistics...
de: Hinweisstatistiken werden geladen...
es: Cargando estadísticas de pistas...
tr: İpucu istatistikleri yükleniyor...

# noHintStatsAvailable
source: No hint statistics available
de: Keine Hinweisstatistiken verfügbar
es: No hay estadísticas de pistas disponibles
tr: Mevcut ipucu istatistiği yok

# revealLetterHint
source: Reveal Letter
de: Buchstabe Enthüllen
es: Revelar Letra
tr: Harf Açma

# skipWordTitle
source: Skip Word
de: Wort Überspringen
es: Saltar Palabra
tr: Kelime Atla

# hintUsageTitle
source: Hint Usages
de: Hinweisverwendungen
es: Uso de Pistas
tr: İpucu Kullanımları

source: Error loading leveling data
de: Fehler beim Laden der Leveldaten
es: Error al cargar los datos de nivelación
tr: Seviye atlama verisi yüklenirken hata oluştu

source: No progress in leveling
de: Kein Fortschritt beim Leveln
es: No hay progreso en la nivelación
tr: Seviye atlama için ilerleme yok

# levelingProgressTitle
source: Leveling Progress
de: Level-Fortschritt
es: Progreso de Nivelación
tr: Seviye İlerlemesi

source: {levelPercentage}% completed
de: {levelPercentage} % abgeschlossen
es: {levelPercentage} % completado
tr: %{levelPercentage} tamamlandı

# levelUpTitle
source: Level Up!
de: Level Aufgestiegen!
es: ¡Has subido de nivel!
tr: Seviye Atladın!

# adminXpGivenSnackBar
source: +{amount} XP added!
de: +{amount} XP hinzugefügt!
es: +{amount} XP añadidos!
tr: +{amount} XP eklendi!

# adminLevelResetSnackBar
source: Level reset!
de: Level zurückgesetzt!
es: Nivel reiniciado!
tr: Level sıfırlandı!

# adminGiveXpButtonTitle
source: Give +{amount} XP
de: +{amount} XP geben
es: Dar +{amount} XP
tr: +{amount} XP Ver

# adminGiveXpButtonDesc
source: Adds +{amount} to the user's current XP.
de: Fügt den aktuellen XP des Benutzers +{amount} hinzu.
es: Añade +{amount} al XP actual del usuario.
tr: Kullanıcının mevcut XP’sine +{amount} ekler.

# adminResetLevelToOneButtonTitle
source: Reset Level to 1
de: Level auf 1 zurücksetzen
es: Restablecer Nivel a 1
tr: Level 1’e Sıfırla

# adminResetLevelToOneButtonDesc
source: Sets Level=1, XP=95, and totalXp=95.
de: Setzt Level=1, XP=95 und totalXp=95.
es: Establece Nivel=1, XP=95 y totalXp=95.
tr: Level=1, XP=95, totalXp=95 olarak ayarlar.

# adminClearLastLevelCacheButtonTitle
source: Clear Saved last_level
de: Gespeichertes last_level löschen
es: Borrar last_level Guardado
tr: Kayıtlı last_level'ı Temizle

# adminClearLastLevelCacheButtonDesc
source: Deletes the saved 'last_level' from SharedPreferences.
de: Löscht das gespeicherte 'last_level' aus SharedPreferences.
es: Elimina el 'last_level' guardado de SharedPreferences.
tr: SharedPreferences içindeki kayıtlı last_level silinir.

# adminLastLevelCacheClearedSnackBar
source: Saved last_level cleared!
de: Gespeichertes last_level gelöscht!
es: last_level guardado borrado!
tr: Kayıtlı last_level temizlendi!

# adminClearAllLocalDataButtonTitle
source: Clear All Local Data
de: Alle lokalen Daten löschen
es: Borrar Todos los Datos Locales
tr: Tüm Yerel Verileri Temizle

# adminClearAllLocalDataButtonDesc
source: Deletes ALL data in SharedPreferences. (Irreversible)
de: Löscht ALLE Daten in SharedPreferences. (Nicht rückgängig machbar)
es: Elimina TODOS los datos en SharedPreferences. (Irreversible)
tr: SharedPreferences içindeki TÜM veriler silinir. (Geri alınamaz)

# adminClearAllConfirmationTitle
source: Are You Sure?
de: Sind Sie sicher?
es: ¿Está seguro?
tr: Emin misiniz?

# adminClearAllConfirmationDesc
source: All local data (settings, level, cache, etc.) will be permanently deleted. This action is irreversible!
de: Alle lokalen Daten (Einstellungen, Level, Cache usw.) werden dauerhaft gelöscht. Diese Aktion ist nicht rückgängig machbar!
es: Todos los datos locales (configuración, nivel, caché, etc.) se eliminarán permanentemente. ¡Esta acción es irreversible!
tr: Tüm yerel veriler (ayarlar, seviye, cache vb.) kalıcı olarak silinecek. Bu işlem geri alınamaz!

# adminClearAllButtonText
source: Clear Data
de: Daten löschen
es: Borrar Datos
tr: Verileri Temizle

# adminAllLocalDataClearedSnackBar
source: All local data cleared!
de: Alle lokalen Daten gelöscht!
es: Todos los datos locales borrados!
tr: Tüm yerel veriler temizlendi!

# adminClearAllLocalDataErrorSnackBar
source: An error occurred while clearing local data
de: Beim Löschen lokaler Daten ist ein Fehler aufgetreten
es: Ocurrió un error al borrar los datos locales
tr: Yerel veriler temizlenirken hata oluştu

# errorPermissionDenied
source: Permission denied
de: Berechtigung verweigert
es: Permiso denegado
tr: İzin reddedildi

# errorSessionExpired
source: Session expired, please log in again
de: Sitzung abgelaufen, bitte erneut anmelden
es: La sesión ha expirado, por favor inicie sesión nuevamente
tr: Oturum süresi doldu, lütfen tekrar giriş yapın

# errorInvalidSession
source: Invalid session, please log in again
de: Ungültige Sitzung, bitte erneut anmelden
es: Sesión inválida, por favor inicie sesión nuevamente
tr: Geçersiz oturum, lütfen tekrar giriş yapın

# errorProfileUpdateFailed
source: Profile update failed!
de: Profilaktualisierung fehlgeschlagen
es: Error al actualizar el perfil
tr: Profil güncellemesi başarısız

# errorRequiresRecentLogin
source: This operation requires recent login. Please log in again and try again.
de: Sensibler Vorgang erfordert kürzliche Anmeldung
es: Operación sensible, se requiere un inicio de sesión reciente
tr: Bu işlem için yakın zamanda giriş yapmanız gerekiyor

# errorChangePasswordFailed
source: Password change failed
de: Ändern des Passworts fehlgeschlagen
es: Error al cambiar la contraseña
tr: Şifre değiştirme başarısız

# errorPasswordsDoNotMatch
source: Passwords do not match!
de: Passwörter stimmen nicht überein!
es: Las contraseñas no coinciden!
tr: Şifreler eşleşmiyor!

# passwordChangeSuccessful
source: Password changed successfully!
de: Passwort erfolgreich geändert!
es: ¡Contraseña cambiada con éxito!
tr: Şifre başarıyla değiştirildi!

# profileUpdateSuccessful
source: Profile updated successfully!
de: Profil erfolgreich aktualisiert!
es: ¡Perfil actualizado con éxito!
tr: Profil başarıyla güncellendi!

# accountSettingsTitle
source: Account Settings
de: Kontoeinstellungen
es: Configuración de la cuenta
tr: Hesap Ayarları

# personalInfoTitle
source: Personal Information
de: Persönliche Informationen
es: Información personal
tr: Kişisel Bilgiler

# displayNameLabel
source: Display Name
de: Anzeigename
es: Nombre para mostrar
tr: Görünen Ad

# createdAtLabel
source: Created At
de: Erstellt am
es: Creado en
tr: Katılma Tarihi

# passwordUpdateTitle
source: Password Update
de: Passwortaktualisierung
es: Actualización de contraseña
tr: Şifre Güncelleme

# currentPasswordLabel
source: Current Password
de: Aktuelles Passwort
es: Contraseña actual
tr: Mevcut Şifre

# newPasswordLabel
source: New Password
de: Neues Passwort
es: Nueva contraseña
tr: Yeni Şifre

# confirmNewPasswordLabel
source: Confirm New Password
de: Neues Passwort bestätigen
es: Confirmar nueva contraseña
tr: Yeni Şifre (Tekrar)

# updatePasswordLabel
source: Update Password
de: Passwort aktualisieren
es: Actualizar contraseña
tr: Şifreyi Güncelle

# externalProviderPasswordChangeDisabled
source: This account was created using an external provider (e.g., Google, GitHub), so the password cannot be changed.
de: Dieses Konto wurde mit einem externen Anbieter (z. B. Google, GitHub) erstellt, sodass das Passwort nicht geändert werden kann.
es: Esta cuenta fue creada utilizando un proveedor externo (por ejemplo, Google, GitHub), por lo que no se puede cambiar la contraseña.
tr: Bu hesap bir dış sağlayıcı (ör. Google, GitHub) ile oluşturulduğu için şifre değiştirilemez.

# accountSettingsSubtitle
source: Manage your account information and update your password.
de: Verwalte deine Kontoinformationen und Sicherheitseinstellungen
es: Gestiona la información de tu cuenta y actualiza tu contraseña.
tr: Hesap bilgilerinizi ve şifrenizi yönetin.

# shopTitle
source: Shop
es: Tienda
tr: Mağaza

# buyLabel
source: Buy
de: Kaufen
es: Comprar
tr: Satın Al

# equipLabel
source: Equip
de: Anlegen
es: Equipar
tr: Kuşan

# equippedLabel
source: Equipped
de: Angelegt
es: Equipado
tr: Kuşanıldı
